In [2]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [3]:
DF_Obj = DataFrame({'column1':[1,2,2,3,3,3],
                    'column2':['a','b','b','c','c','c'],
                    'column3':['A','B','B','C','C','C']})
DF_Obj

   column1 column2 column3
0        1       a       A
1        2       b       B
2        2       b       B
3        3       c       C
4        3       c       C
5        3       c       C

In [4]:
DF_Obj.duplicated()

0    False
1    False
2     True
3    False
4     True
5     True
dtype: bool

In [5]:
DF_Obj.drop_duplicates()

   column1 column2 column3
0        1       a       A
1        2       b       B
3        3       c       C

In [6]:
DF_Obj = DataFrame({'column1':[1,2,2,3,3,3],
                    'column2':['a','b','b','c','c','c'],
                    'column3':['A','B','B','C','D','C']})
DF_Obj

   column1 column2 column3
0        1       a       A
1        2       b       B
2        2       b       B
3        3       c       C
4        3       c       D
5        3       c       C

In [7]:
DF_Obj.drop_duplicates('column3')

   column1 column2 column3
0        1       a       A
1        2       b       B
3        3       c       C
4        3       c       D